laravel-project01/app/Http/Controllers/UserController.php

update `users` set `family_id` = '10', `users`.`updated_at` = '2023-08-04 01:06:08' where `id` = 10
---
    public function update(SaveUserRequest $request, $id)
    {
        $inputs = array_filter($request->all());
        if ($request->password) {
            $inputs['password'] = bcrypt($request->password);
        }
        User::find($id)->update($inputs);