laravel-project01/app/Http/Controllers/UserController.php

    public function index()
    {
        return view('users_management.index', [
            'users' => $this->users->orderBy('id', 'desc')->get(),
        ]);
---
select * from `users` order by `id` desc

    public function store(SaveUserRequest $request)
    {
        $inputs = $request->all();
        $inputs['password'] = bcrypt($request->password);
        $inputs['type'] = User::TYPE['Admin_System'];

        if ($request->avatar) {
            $path = Storage::disk('public')->put('media', $request->avatar);
            $inputs['avatar'] = Storage::disk('public')->url($path);
        }

        User::create($inputs);
---
insert into `users` (`name`, `phone`, `email`, `gender`, `password`, `family_id`, `avatar`, `type`, `updated_at`, `created_at`) values ('test4', '3213213123', 'tangocdai1311@gmail.com', '1', '$2y$10$m3RLUgevsyLUNdPdOcaq4ONX1KU5n39dd.r/o4E7GNkVq24HQesbC', '3', 'http://localhost/storage/media/HeeqrYwNONSVpUlbm8opmxc4P4cAICgeEPg6IyaF.png', 1, '2023-08-04 01:36:18', '2023-08-04 01:36:18')

    public function edit($id)
    {
        $url = $this->users->find($id)->avatar;
        $avatarName = basename($url);

        return view('users_management.form', [
            'user' => $this->users->find($id),
            'families' => $this->families->getAllFamily(),
            'avatarName' => $avatarName,
        ]);
---
select * from `users` where `users`.`id` = '38' limit 1
select * from `families` where `families`.`id` = '15' limit 1