laravel-project01/app/Models/Family.php

    public function getAllFamily()
    {
        $families = DB::table($this->table)->get();
---
select * from `families`